<div class="row">
        <div class="col-lg-9">
            <h1>1082.Sales Analysis I</h1>
            <div class="markdown-body" style="margin-top: 20px">
                <p>Table:&nbsp;<code>Product</code></p>

<pre>
+--------------+---------+
| Column Name  | Type    |
+--------------+---------+
| product_id   | int     |
| product_name | varchar |
| unit_price   | int     |
+--------------+---------+
product_id is the primary key of this table.
</pre>

<p>Table:&nbsp;<code>Sales</code></p>

<pre>
+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| seller_id   | int     |
| product_id  | int     |
| buyer_id    | int     |
| sale_date   | date    |
| quantity    | int     |
| price       | int     |
+------ ------+---------+
This table has no primary key, it can have repeated rows.
product_id is a foreign key to Product table.
</pre>

<p>&nbsp;</p>

<p>Write an SQL query that reports the best&nbsp;<strong>seller</strong>&nbsp;by total sales price, If there is a tie, report them all.</p>

<p>The query result format is in the following example:</p>

<pre>
Product table:
+------------+--------------+------------+
| product_id | product_name | unit_price |
+------------+--------------+------------+
| 1          | S8           | 1000       |
| 2          | G4           | 800        |
| 3          | iPhone       | 1400       |
+------------+--------------+------------+

<code>Sales </code>table:
+-----------+------------+----------+------------+----------+-------+
| seller_id | product_id | buyer_id | sale_date  | quantity | price |
+-----------+------------+----------+------------+----------+-------+
| 1         | 1          | 1        | 2019-01-21 | 2        | 2000  |
| 1         | 2          | 2        | 2019-02-17 | 1        | 800   |
| 2         | 2          | 3        | 2019-06-02 | 1        | 800   |
| 3         | 3          | 4        | 2019-05-13 | 2        | 2800  |
+-----------+------------+----------+------------+----------+-------+

Result table:
+-------------+
| seller_id   |
+-------------+
| 1           |
| 3           |
+-------------+
Both sellers with id 1 and 3 sold products with the most total price of 2800.</pre>

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [2]:
pd.read_sql_table("Product", engine)

   product_id product_name  unit_price
0           1           S8        1000
1           2           G4         800
2           3       iPhone        1400

In [3]:
pd.read_sql_table("Sales", engine)

   seller_id  product_id  buyer_id  sale_date  quantity  price
0          1           1         1 2019-01-21         2   2000
1          1           2         2 2019-02-17         1    800
2          2           2         3 2019-06-02         1    800
3          3           3         4 2019-05-13         2   2800

In [7]:
query = '''
SELECT DISTINCT s.seller_id
FROM Sales s
GROUP BY s.seller_id
HAVING sum(price) = (SELECT sum(sp.price)
FROM Sales sp
GROUP BY sp.seller_id
ORDER BY sum(sp.price) DESC
LIMIT 1);
'''
pd.read_sql_query(query, engine)

   seller_id
0          1
1          3

## Note:
# Time: O(m+n)
# Space: O(m+n)

#### 1. Subquery from the qualify id and match id to find information in the other tables.